**Importing Module**

In [1]:
import pandas as pd

**Dataset Load**

In [2]:
df = pd.read_csv('employees.csv')

**Display First Five row of dataframe**

In [3]:
df.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male   8/6/1993  ...   6.945               True        Marketing
1     Thomas    Male  3/31/1996  ...   4.170               True              NaN
2      Maria  Female  4/23/1993  ...  11.858              False          Finance
3      Jerry    Male   3/4/2005  ...   9.340               True          Finance
4      Larry    Male  1/24/1998  ...   1.389               True  Client Services

[5 rows x 8 columns]

**Drop row contain NaN values from dataframe**

In [4]:
df.dropna(inplace=True)

**Shape of Dataframe**

In [5]:
df.shape

(764, 8)

**Creating copy of original dataframe**

In [6]:
df1 = df

**Display Duplicates in dataframe**

---
If duplicates row present in dataframe then display True else False

In [7]:
df1.duplicated()

0      False
2      False
3      False
4      False
5      False
       ...
994    False
996    False
997    False
998    False
999    False
Length: 764, dtype: bool

**Shape of dataframe after removing duplicate rows from dataframe**

In [8]:
(df1.drop_duplicates()).shape

(764, 8)

**Sort the rows** on behave of column name as 'First Name' in dataframe

In [9]:
df1.sort_values('First Name', inplace=True)

diaplay values in column 'First Name'

In [10]:
df1['First Name']

440     Aaron
327     Aaron
101     Aaron
137      Adam
538      Adam
        ...
112    Willie
652    Willie
204    Willie
450    Willie
175    Willie
Name: First Name, Length: 764, dtype: object

**Shows duplicates values present in column 'First Name'**

In [11]:
df1['First Name'].duplicated()

440    False
327     True
101     True
137    False
538     True
       ...
112    False
652     True
204     True
450     True
175     True
Name: First Name, Length: 764, dtype: bool

**Note:- About "keep" parameter in drop_duplicates**


---

1.  keep = 'First' :- means Drop duplicates except for the first occurrence. (**default**)
2.  keep = 'last'  :- means Drop duplicates except for the last occurrence.
3.  keep = False  :- means Drop all duplicates

**Removing duplicate using one column in dataframe**

---

Note:- default status of **inplace ** is false, so changes in original dataframe is not reflacted

In [12]:
df1.drop_duplicates(subset=['First Name'], keep='first')

    First Name  Gender  Start Date  ... Bonus %  Senior Management             Team
440      Aaron    Male   7/22/1990  ...  11.343               True  Client Services
137       Adam    Male   5/21/2011  ...  15.120              False     Distribution
610       Alan    Male   2/17/2012  ...  10.084              False          Product
372     Albert    Male    2/1/1997  ...  19.717               True      Engineering
425      Alice  Female    5/2/1986  ...   2.378               True          Finance
..         ...     ...         ...  ...     ...                ...              ...
899     Walter    Male   5/21/1992  ...  16.323               True        Marketing
433      Wanda  Female   7/20/2008  ...   7.132               True            Legal
637      Wayne    Male    9/2/2009  ...  18.396              False  Human Resources
941    William    Male   6/26/1997  ...  15.653               True      Engineering
112     Willie    Male  11/27/2003  ...   4.023              False        Marketing

[199 rows x 8 columns]

**Removing duplicate using multiple columns in dataframe**


---
In this case, first the duplicates rows are remove on behave of first column, than after second column and so on...

In this given example, two columns are taken to remove duplicate from dataframe

In [13]:
df1.drop_duplicates(subset=['First Name', 'Team'], keep='first')

    First Name Gender  Start Date  ... Bonus %  Senior Management             Team
440      Aaron   Male   7/22/1990  ...  11.343               True  Client Services
327      Aaron   Male   1/29/1994  ...   5.097               True        Marketing
137       Adam   Male   5/21/2011  ...  15.120              False     Distribution
538       Adam   Male   10/8/2010  ...   3.491              False  Human Resources
141       Adam   Male  12/24/1990  ...  14.727               True          Product
..         ...    ...         ...  ...     ...                ...              ...
941    William   Male   6/26/1997  ...  15.653               True      Engineering
127    William   Male   9/29/2002  ...   5.830              False  Human Resources
112     Willie   Male  11/27/2003  ...   4.023              False        Marketing
652     Willie   Male   12/5/2009  ...   1.017               True      Engineering
450     Willie   Male   8/22/2009  ...  19.691              False            Legal

[632 rows x 8 columns]

In [14]:
df1.drop_duplicates(subset=['First Name', 'Team'], inplace = True)

In [15]:
df1.shape

(632, 8)

**pandas.unique(values)**

In [16]:
pd.unique(df['First Name'])

array(['Aaron', 'Adam', 'Alan', 'Albert', 'Alice', 'Amanda', 'Amy',
       'Andrea', 'Andrew', 'Angela', 'Ann', 'Anna', 'Anne', 'Annie',
       'Anthony', 'Antonio', 'Arthur', 'Ashley', 'Barbara', 'Benjamin',
       'Betty', 'Beverly', 'Billy', 'Bobby', 'Bonnie', 'Brandon',
       'Brenda', 'Brian', 'Bruce', 'Carl', 'Carlos', 'Carol', 'Carolyn',
       'Catherine', 'Charles', 'Cheryl', 'Christina', 'Christine',
       'Christopher', 'Clarence', 'Craig', 'Cynthia', 'Daniel', 'David',
       'Deborah', 'Debra', 'Denise', 'Dennis', 'Diana', 'Diane', 'Donald',
       'Donna', 'Doris', 'Dorothy', 'Douglas', 'Earl', 'Edward',
       'Elizabeth', 'Emily', 'Eric', 'Ernest', 'Eugene', 'Evelyn',
       'Frances', 'Frank', 'Fred', 'Gary', 'George', 'Gerald', 'Gloria',
       'Gregory', 'Harold', 'Harry', 'Heather', 'Helen', 'Henry',
       'Howard', 'Irene', 'Jack', 'Jacqueline', 'James', 'Jane', 'Janet',
       'Janice', 'Jason', 'Jean', 'Jeffrey', 'Jennifer', 'Jeremy',
       'Jerry', 'Jesse', 'Jessica', 'Jimmy', 'Joan', 'Joe', 'John',
       'Johnny', 'Jonathan', 'Jose', 'Joseph', 'Joshua', 'Joyce', 'Juan',
       'Judith', 'Judy', 'Julia', 'Julie', 'Justin', 'Karen', 'Katherine',
       'Kathleen', 'Kathryn', 'Kathy', 'Keith', 'Kelly', 'Kenneth',
       'Kevin', 'Kimberly', 'Larry', 'Laura', 'Lawrence', 'Lillian',
       'Linda', 'Lisa', 'Lois', 'Lori', 'Louis', 'Louise', 'Margaret',
       'Maria', 'Marie', 'Marilyn', 'Mark', 'Martha', 'Martin', 'Mary',
       'Matthew', 'Melissa', 'Michael', 'Michelle', 'Mildred', 'Nancy',
       'Nicholas', 'Nicole', 'Norma', 'Pamela', 'Patricia', 'Patrick',
       'Paul', 'Paula', 'Peter', 'Philip', 'Phillip', 'Phyllis', 'Rachel',
       'Ralph', 'Randy', 'Raymond', 'Rebecca', 'Richard', 'Robert',
       'Robin', 'Roger', 'Ronald', 'Rose', 'Roy', 'Ruby', 'Russell',
       'Ruth', 'Ryan', 'Samuel', 'Sandra', 'Sara', 'Sarah', 'Scott',
       'Sean', 'Sharon', 'Shawn', 'Shirley', 'Stephanie', 'Stephen',
       'Steve', 'Steven', 'Susan', 'Tammy', 'Teresa', 'Terry', 'Theresa',
       'Thomas', 'Timothy', 'Tina', 'Todd', 'Victor', 'Virginia',
       'Walter', 'Wanda', 'Wayne', 'William', 'Willie'], dtype=object)